bench/results/dotnet-aot/v3-20260526-210210-dotnet-aot/read-c200.txt
Running 30s test @ http://localhost:3004
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.65ms    3.34ms  69.28ms   86.85%
    Req/Sec     2.17k   360.00     2.90k    68.00%
  519006 requests in 30.03s, 95.03MB read
  Non-2xx or 3xx responses: 519006
Requests/sec:  17283.20
Transfer/sec:      3.16MB